The minimum length of rebar shape is 1 inch.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId RebarTooShortImperial { get; }
  Visual Basic
Public Shared ReadOnly Property RebarTooShortImperial As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ RebarTooShortImperial {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures RebarFailures Class
  Autodesk.Revit.DB Namespace